Repository: AYAEMAD0/ShopCraft
Catalog: lib/l10n/intl_*.arb
Languages: ar

# appTitle
source: ShopCraft
ar: شوب كرافت

# welcomeSubtitle
source: Your Premium Shopping Experience
ar: تجربة تسوق مميزة

source: Our Products
ar: منتجاتنا

source: Hot Offers
ar: العروض الساخنة

source: Featured Products
ar: منتجات مميزة

# shopCollection
source: Shop Our Collection
ar: تصفح مجموعتنا

source: Sign Up
ar: تسجيل حساب

source: Sign In
ar: تسجيل دخول

source: Create Account
ar: إنشاء حساب

source: Welcome Back
ar: مرحباً بعودتك

# signInTo
source: Sign in to ShopCraft
ar: سجل الدخول إلى شوب كرافت

source: Full Name
ar: الاسم الكامل

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Confirm Password
ar: تأكيد كلمة المرور

source: Success!
ar: نجاح!

# accountCreated
source: Account created successfully
ar: تم إنشاء الحساب بنجاح

# accountSignedIn
source: Account sign-in successfully
ar: تم تسجيل الدخول بنجاح

source: Close
ar: إغلاق

# offer1Title
source: 50% Off Electronics
ar: خصم 50% على الإلكترونيات

# offer1Subtitle
source: Limited time offer on all tech gadgets
ar: لفترة محدودة على جميع الأجهزة التقنية

# offer1Shape
source: 50% OFF
ar: خصم 50%

# offer2Title
source: Free Shipping Weekend
ar: شحن مجاني في عطلة نهاية الأسبوع

# offer2Subtitle
source: No delivery charges on orders above $50
ar: بدون رسوم توصيل للطلبات فوق 50 دولار

# offer2Shape
source: FREE SHIP
ar: شحن مجاني

# offer3Title
source: Buy 2 Get 1 Free
ar: اشترِ 2 واحصل على 1 مجانًا

# offer3Subtitle
source: On selected accessories and peripherals
ar: على بعض الإكسسوارات المختارة

# offer3Shape
source: B2G1
ar: 2+1 مجانًا

# offer4Title
source: Student Discount
ar: خصم طلابي

# offer4Subtitle
source: Extra 20% off with valid student ID
ar: خصم إضافي 20% ببطاقة طالب سارية

# offer4Shape
source: 20% OFF
ar: خصم 20%

# offer5Title
source: Bundle Deals
ar: عروض الباقات

# offer5Subtitle
source: Save more when you buy complete setups
ar: وفر أكثر عند شراء حزمة كاملة

# offer5Shape
source: BUNDLE
ar: باقات

# itemAddedToCart
source: Item added to the cart
ar: تمت إضافة العنصر إلى السلة

# productAddedSuccessfully
source: {productName} added successfully!
ar: تمت إضافة {productName} بنجاح!

# carouselTitle1
source: Premium Laptop Collection
ar: مجموعة لابتوبات مميزة

# carouselTitle2
source: Professional Workspace
ar: مساحة عمل احترافية

# carouselTitle3
source: Ambient Lighting
ar: إضاءة مريحة

# dialogSuccessTitle
source: Welcome!
ar: مرحبا!

# dialogSuccessDescription
source: Account sign-in successfully
ar: تم تسجيل الدخول إلى الحساب بنجاح

# dialogButtonText
source: Close
ar: إغلاق

# product_macbook
source: MacBook Pro 16
ar: ماك بوك برو 16

# product_headphones
source: Wireless Headphones
ar: سماعات لاسلكية

# product_watch
source: Smart Watch
ar: ساعة ذكية

# product_backpack
source: Designer Backpack
ar: حقيبة ظهر أنيقة

# product_keyboard
source: Premium Keyboard
ar: لوحة مفاتيح مميزة

# product_mouse
source: Wireless Mouse
ar: فأرة لاسلكية

# fieldRequired
source: {field} is required
ar: حقل {field} مطلوب

# enterValidEmail
source: Please enter a valid email
ar: يرجى إدخال بريد إلكتروني صحيح

# passwordMinLength
source: Password must be at least 6 characters
ar: كلمة المرور يجب أن تكون 6 أحرف على الأقل

source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# lettersOnly
source: Only letters and spaces are allowed
ar: مسموح فقط بالحروف والمسافات

# firstLetterUppercase
source: First letter must be uppercase
ar: يجب أن يبدأ الاسم بحرف كبير
